Hi,

I am getting the same issue when trying to create an enforcer group using provider version 0.8.2:

```
aquasec_user.user: Refreshing state... [id=test-user-12345]
An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
Terraform will perform the following actions:
  # aquasec_enforcer_groups.new will be created
  + resource "aquasec_enforcer_groups" "new" {
      + command                       = (known after apply)
      + container_activity_protection = (known after apply)
      + description                   = "Created1"
      + enforce                       = true
      + gateway_address               = (known after apply)
      + gateway_name                  = (known after apply)
      + gateways                      = [
          + "xxxxxxxxxxxxxxxxxxxxxxxxxxxxxxxx",
        ]
      + group_id                      = "terraform"
      + host_os                       = (known after apply)
      + id                            = (known after apply)
      + install_command               = (known after apply)
      + last_update                   = (known after apply)
      + logical_name                  = "terraform-eg"
      + network_protection            = (known after apply)
      + token                         = (known after apply)
      + type                          = "agent"
      + orchestrator {
          + master          = false
          + namespace       = "aqua"
          + service_account = "aquasa"
          + type            = "kubernetes"
        }
    }
Plan: 1 to add, 0 to change, 0 to destroy.
Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.
  Enter a value: yes
aquasec_enforcer_groups.new: Creating...
Error: enforcer group not found: terraform`
```
